In [3]:
import pandas as pd

In [4]:
#Series de Pandas
numeros = [3,4,5,6,7]
serie = pd.Series(numeros)
serie, type(serie)

(0    3
 1    4
 2    5
 3    6
 4    7
 dtype: int64,
 pandas.core.series.Series)

In [6]:
#DataFrames 
data = {
    "name": ["Alice", "Bob", "Charlie"],
    "age": [25, 30, 35],
    "city": ["New York", "London", "Paris"]
}
data, type(data)

({'name': ['Alice', 'Bob', 'Charlie'],
  'age': [25, 30, 35],
  'city': ['New York', 'London', 'Paris']},
 dict)

In [7]:
#Generar un DataFrame apartir de un diccionario
df = pd.DataFrame(data=data)
df

      name  age      city
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

In [8]:
#Exportar DataFrame
df.to_csv("data.csv")

In [12]:
#Importar DataFrame
import_df = pd.read_csv("data.csv", index_col=0)

import_df

      name  age      city
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris